In [8]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\swapnil\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\swapnil\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\swapnil\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\swapnil\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\swapnil\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\swapnil\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [9]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt

In [10]:
hdata=pd.read_csv("Bengaluru_House_Data.csv")
hdata.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [11]:
hdata.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [7]:
hdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37539 entries, 0 to 37538
Data columns (total 24 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          37539 non-null  int64
 1   additionalrooms     9321 non-null   object
 2   age                 27637 non-null  object
 3   amenitiesavailable  34445 non-null  object
 4   amenitiesnot        34286 non-null  object
 5   area                37518 non-null  object
 6   balconies           21911 non-null  object
 7   bathroom            34667 non-null  object
 8   bhk                 37538 non-null  object
 9   carpetarea          8622 non-null   object
 10  facing              30919 non-null  object
 11  floor               31919 non-null  object
 12  locality            37538 non-null  object
 13  neworold            37538 non-null  object
 14  opensides           11605 non-null  object
 15  overlooking         17140 non-null  object
 16  ownership           28156 non-null  object
 17  possesiondate       4736 non-null   object
 18  price               37538 non-null  object
 19  pricepersquare      37538 non-null  object
 20  projectname         24129 non-null  object
 21  roadfaceing         6875 non-null   object
 22  status              36078 non-null  object
 23  totalfloor          24114 non-null  object
dtypes: int64(1), object(23)
memory usage: 6.9+ MB

In [12]:
hdata['area_type'].unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [22]:
hdata['area_type'].value_counts()

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64

In [19]:
hdata['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [26]:
hdata['balcony'].unique()

array([ 1.,  3., nan,  2.,  0.])

In [25]:
hdata['balcony'].value_counts()

balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64

Data Cleaning Handling NA Values

In [27]:
hdata.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [28]:
hdata.shape

(13320, 9)

In [29]:
hdata['balcony'].median()

2.0

In [30]:
hdata['balcony']=hdata['balcony'].fillna(hdata.balcony.median())
hdata.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony            0
price              0
dtype: int64

In [37]:
hdata1=hdata.drop(['society','availability'],axis=1)
hdata1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   area_type   13320 non-null  object
 1   location    13319 non-null  object
 2   size        13304 non-null  object
 3   total_sqft  13320 non-null  object
 4   bath        13247 non-null  float64
 5   balcony     13320 non-null  float64
 6   price       13320 non-null  float64
dtypes: float64(3), object(4)
memory usage: 728.6+ KB

In [38]:
hdata1.head()

,area_type,location,size,total_sqft,bath,balcony,price
0,Super built-up Area,Electronic City Phase II,2 BHK,1056,2.0,1.0,39.07
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600,5.0,3.0,120.00
2,Built-up Area,Uttarahalli,3 BHK,1440,2.0,3.0,62.00
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521,3.0,1.0,95.00
4,Super built-up Area,Kothanur,2 BHK,1200,2.0,1.0,51.00

In [39]:
hdata1['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [85]:
hdata1['bhk'] = hdata1['size'].apply(lambda x: float(x.split(' ')[0]) if isinstance(x, str) else x)
hdata1.bhk.unique()

array([ 2.,  4.,  3.,  6.,  1.,  8.,  7.,  5., 11.,  9., nan, 27., 10.,
       19., 16., 43., 14., 12., 13., 18.])

In [86]:
hdata1.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [87]:
def is_float(x):           # 1133-1384 to covert into floating point value
    try:
        float(x)
    except:
        return False
    return True

In [65]:
2+3

5

In [63]:
float(2+3)

5.0

In [88]:
hdata1[~hdata1['total_sqft'].apply(is_float)].head(10)

,area_type,location,size,total_sqft,bath,balcony,price,bhk
30,Super built-up Area,Yelahanka,4 BHK,2100 - 2850,4.0,0.0,186.000,4.0
56,Built-up Area,Devanahalli,4 Bedroom,3010 - 3410,NaN,2.0,192.000,4.0
81,Built-up Area,Hennur Road,4 Bedroom,2957 - 3450,NaN,2.0,224.500,4.0
122,Super built-up Area,Hebbal,4 BHK,3067 - 8156,4.0,0.0,477.000,4.0
137,Super built-up Area,8th Phase JP Nagar,2 BHK,1042 - 1105,2.0,0.0,54.005,2.0
165,Super built-up Area,Sarjapur,2 BHK,1145 - 1340,2.0,0.0,43.490,2.0
188,Super built-up Area,KR Puram,2 BHK,1015 - 1540,2.0,0.0,56.800,2.0
224,Super built-up Area,Devanahalli,3 BHK,1520 - 1740,NaN,2.0,74.820,3.0
410,Super built-up Area,Kengeri,1 BHK,34.46Sq. Meter,1.0,0.0,18.500,1.0
549,Super built-up Area,Hennur Road,2 BHK,1195 - 1440,2.0,0.0,63.770,2.0

In [89]:
def convert_sqft_to_num(x):
    tokens=x.split('-')
    if len(tokens)==2:
        return(float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [90]:
hdata2=hdata1.copy()

In [91]:
hdata2.total_sqft = hdata2.total_sqft.apply(convert_sqft_to_num)# apply function
hdata2=hdata2[hdata2.total_sqft.notnull()]
hdata2.head()

,area_type,location,size,total_sqft,bath,balcony,price,bhk
0,Super built-up Area,Electronic City Phase II,2 BHK,1056.0,2.0,1.0,39.07,2.0
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.0,120.00,4.0
2,Built-up Area,Uttarahalli,3 BHK,1440.0,2.0,3.0,62.00,3.0
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521.0,3.0,1.0,95.00,3.0
4,Super built-up Area,Kothanur,2 BHK,1200.0,2.0,1.0,51.00,2.0

In [92]:
print(hdata2.iloc[30])
hdata1.iloc[30]

area_type     Super built-up  Area
location                 Yelahanka
size                         4 BHK
total_sqft                  2475.0
bath                           4.0
balcony                        0.0
price                        186.0
bhk                            4.0
Name: 30, dtype: object

area_type     Super built-up  Area
location                 Yelahanka
size                         4 BHK
total_sqft             2100 - 2850
bath                           4.0
balcony                        0.0
price                        186.0
bhk                            4.0
Name: 30, dtype: object

In [93]:
hdata2.dtypes

area_type      object
location       object
size           object
total_sqft    float64
bath          float64
balcony       float64
price         float64
bhk           float64
dtype: object

add new features called price per sqft

In [95]:
hdata3=hdata2.copy()
hdata3['price_per_sqft'] = hdata3['price']*100000/hdata3['total_sqft']
hdata3.head()

,area_type,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,Super built-up Area,Electronic City Phase II,2 BHK,1056.0,2.0,1.0,39.07,2.0,3699.810606
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.0,120.00,4.0,4615.384615
2,Built-up Area,Uttarahalli,3 BHK,1440.0,2.0,3.0,62.00,3.0,4305.555556
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521.0,3.0,1.0,95.00,3.0,6245.890861
4,Super built-up Area,Kothanur,2 BHK,1200.0,2.0,1.0,51.00,2.0,4250.000000

In [96]:
hdata3.describe()

,total_sqft,bath,balcony,price,bhk,price_per_sqft
count,13274.000000,13201.000000,13274.000000,13274.000000,13258.000000,1.327400e+04
mean,1559.626694,2.691160,1.604565,112.453654,2.802685,7.907501e+03
std,1238.405258,1.338867,0.802569,149.070368,1.292070,1.064296e+05
min,1.000000,1.000000,0.000000,8.000000,1.000000,2.678298e+02
25%,1100.000000,2.000000,1.000000,50.000000,2.000000,4.266865e+03
50%,1276.000000,2.000000,2.000000,72.000000,3.000000,5.434306e+03
75%,1680.000000,3.000000,2.000000,120.000000,3.000000,7.311746e+03
max,52272.000000,40.000000,3.000000,3600.000000,43.000000,1.200000e+07

examine locations

In [97]:
hdata3['location'].value_counts()

location
Whitefield                        538
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    271
Thanisandra                       233
                                 ...
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
Kannur                              1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1299, dtype: int64

In [103]:
hdata3['location'] = hdata3['location'].apply(lambda x: x.strip() if isinstance(x, str) else x)
location_stats = hdata3['location'].value_counts(ascending=False)
location_stats

location
Whitefield                        539
Sarjapur  Road                    399
Electronic City                   304
Kanakpura Road                    271
Thanisandra                       236
                                 ...
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
Kannur                              1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1288, dtype: int64

In [105]:
len(location_stats[location_stats>10])

240

In [106]:
len(location_stats[location_stats<=10])

1048

dimensionality Reduction Any location having less tan 10 data points sholud be tagged as "other" location. this way no. of categories
can be huge amount .
later on we do encoding it will help us with fewer dummy columns

In [107]:
location_stats_less_than_10=location_stats[location_stats>10]
location_stats_less_than_10

location
Whitefield            539
Sarjapur  Road        399
Electronic City       304
Kanakpura Road        271
Thanisandra           236
                     ...
Pattandur Agrahara     11
Banjara Layout         11
HAL 2nd Stage          11
Tindlu                 11
Kodigehalli            11
Name: count, Length: 240, dtype: int64

In [108]:
len(hdata3.location.unique())

1289

In [110]:
hdata3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13274 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   area_type       13274 non-null  object
 1   location        13273 non-null  object
 2   size            13258 non-null  object
 3   total_sqft      13274 non-null  float64
 4   bath            13201 non-null  float64
 5   balcony         13274 non-null  float64
 6   price           13274 non-null  float64
 7   bhk             13258 non-null  float64
 8   price_per_sqft  13274 non-null  float64
dtypes: float64(6), object(3)
memory usage: 1.0+ MB